app/Controllers/BaseController.php

INSERT INTO "indicadorfinancieros" ("nombreindicador", "codigoindicador", "unidadmedidaindicador", "valorindicador", "fechaindicador", "created_at", "updated_at", "id") VALUES ('UNIDAD DE FOMENTO (UF)', 'UF', 'Pesos', 29061.89, '2021-01-09', '2023-02-03 03:32:53', '2023-02-03 03:32:53', 6)
---
                    'fechaindicador'  => $item['fechaIndicador'],
                ];

               $indicadorFinancieroModel->insert($data);