app/Controllers/Home.php

SELECT *
FROM "indicadorfinancieros"
WHERE "indicadorfinancieros"."id" = '1'
---
    public function index()
    {

        $db = db_connect();
        $ifModel = new IndicadorFinancieroModel($db);
        $indicador = $ifModel->find('6');