app/Controllers/IndicadorFinancieroController.php

SELECT *
FROM "indicadorfinancieros"
ORDER BY "fechaindicador" DESC
---
    public function index()
    {
        $modelo = new IndicadorFinancieroModel();
        $data['indicadores_uf'] = $modelo->orderBy('fechaindicador','DESC')->findAll();

SELECT *
FROM "indicadorfinancieros"
ORDER BY "fechaindicador" DESC
---
    public function getAll()
    {
        $modelo = new IndicadorFinancieroModel();
        $data['data'] = $modelo->orderBy('fechaindicador','DESC')->findAll();

SELECT "fechaindicador", "valorindicador"
FROM "indicadorfinancieros"
ORDER BY "fechaindicador" DESC
SELECT "fechaindicador", "valorindicador"
FROM "indicadorfinancieros"
WHERE "fechaindicador" >= '2020-01-01'
AND "fechaindicador" <= '2023-03-28'
ORDER BY "fechaindicador" DESC
---
    public function getGraph()
    {
        helper(['form','url']);
        $modelo = new IndicadorFinancieroModel();
        $fechaInicio=$this->request->getVar('fechaInicio');
        $fechaFin=$this->request->getVar('fechaFin');
        $x = array();
        $y = array();
        if(empty($fechaInicio)||empty($fechaFin)) {
            $filtro =$modelo->select('fechaindicador,valorindicador')->orderBy('fechaindicador','DESC')->findAll();
            foreach ($filtro as $row) {
                array_push($x, $row['fechaindicador']);
                array_push($y, $row['valorindicador']);
            }
            $data=[
                "x"=>$x,
                "y"=>$y
            ];
            return $this->respond($data, 200);
        }
        if($fechaInicio> $fechaFin) {
            $data=[
                "x"=>[],
                "y"=>[]
            ];
            return $this->respond($data, 400);
        }

        $filtro =$modelo->select('fechaindicador,valorindicador')->where('fechaindicador >=',$fechaInicio)->where('fechaindicador <=',$fechaFin)->orderBy('fechaindicador','DESC')->findAll();

SELECT COUNT(*) AS "numrows"
FROM "indicadorfinancieros"
WHERE "fechaindicador" = '2023-02-15'
SELECT *
FROM "indicadorfinancieros"
ORDER BY "id" DESC
 LIMIT 1
INSERT INTO "indicadorfinancieros" ("nombreindicador", "codigoindicador", "unidadmedidaindicador", "valorindicador", "fechaindicador", "created_at", "updated_at", "id") VALUES ('UNIDAD DE FOMENTO (UF)', 'UF', 'Pesos', '222222222222222', '2023-02-15', '2023-02-05 02:20:12', '2023-02-05 02:20:12', 1806)
---
    public function create()
    {

        helper(['form','url']);
        $modelo = new IndicadorFinancieroModel();
        $existeFecha =$modelo->where('fechaindicador',$this->request->getVar('addDate'))->countAllResults();
        if ($existeFecha > 0) {
            return $this->fail(null, 402,"fecha ya esta registrada");
        }

        $maxIdRow = $modelo->orderBy('id','DESC')->first();
        $newId=$maxIdRow['id']+1;

        $data = [
            'id'=>$newId,
            'nombreindicador'  => 'UNIDAD DE FOMENTO (UF)',
            'codigoindicador'  => 'UF',
            'unidadmedidaindicador'  => 'Pesos',
            'valorindicador'  => $this->request->getVar('addValue'),
            'fechaindicador'  => $this->request->getVar('addDate'),
        ];

        $create = $modelo->insert($data,false);

DELETE FROM "indicadorfinancieros"
WHERE "id" IN ('1806')
---
    public function delete()
    {

        helper(['form','url']);
        $modelo = new IndicadorFinancieroModel();
        $delete = $modelo->delete($this->request->getVar('deleteId'));