app/Controllers/IndicadorFinancieroController.php

    public function create()
    {

        helper(['form','url']);
        $modelo = new IndicadorFinancieroModel();
        $existeFecha =$modelo->where('fechaindicador',$this->request->getVar('addDate'))->countAllResults();
        if ($existeFecha > 0) {
            echo json_encode (array("status" => false));
        }

        $maxIdRow = $modelo->orderBy('id','DESC')->first();
        $newId=$maxIdRow['id']+1;

        $data = [
            'id'=>$newId,
            'nombreindicador'  => 'UNIDAD DE FOMENTO (UF)',
            'codigoindicador'  => 'UF',
            'unidadmedidaindicador'  => 'Pesos',
            'valorindicador'  => $this->request->getVar('addValue'),
            'fechaindicador'  => $this->request->getVar('addDate'),
        ];

        $create = $modelo->insert($data,false);
---
SELECT COUNT(*) AS "numrows"
FROM "indicadorfinancieros"
WHERE "fechaindicador" = '2023-02-16'
SELECT *
FROM "indicadorfinancieros"
ORDER BY "id" DESC
 LIMIT 1
INSERT INTO "indicadorfinancieros" ("nombreindicador", "codigoindicador", "unidadmedidaindicador", "valorindicador", "fechaindicador", "created_at", "updated_at", "id") VALUES ('UNIDAD DE FOMENTO (UF)', 'UF', 'Pesos', '11111', '2023-02-16', '2023-02-04 04:17:35', '2023-02-04 04:17:35', 1810)

    public function delete()
    {

        helper(['form','url']);
        $modelo = new IndicadorFinancieroModel();
        $delete = $modelo->delete($this->request->getVar('deleteId'));
---
DELETE FROM "indicadorfinancieros"
WHERE "id" IN ('1808')